#include "WS2812B.h"
#include "Delay.h"


void RGB_Init(void)
{
 
 GPIO_InitTypeDef  GPIO_InitStructure;
 	
 RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);	 //使能PB端口时钟
	
 GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;				 //LED0-->PB.0 端口配置
 GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP; 		 //推挽输出
 GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;		 //IO口速度为50MHz
 GPIO_Init(GPIOB, &GPIO_InitStructure);					 //根据设定参数初始化GPIOB.0
 GPIO_SetBits(GPIOB,GPIO_Pin_0);						 //PB.0 输出高


}

//每三个字节为一个灯，颜色顺序为绿红蓝
//彩虹颜色箭头
uint8_t Rainbow_data[120] = {
	0X00,0X0F,0X00,//1	一行
	0X03,0X0F,0X00,//2
	0X0C,0X0C,0X00,//3
	0X0D,0X00,0X00,//4
	0X0A,0X00,0X0A,//5
	0X00,0X00,0X3F,//6
	0X00,0X0F,0X0F,//7
	0X00,0X0F,0X02,//8
	
	0X00,0X0F,0X00,//1	二行
	0X03,0X0F,0X00,//2
	0X0C,0X0C,0X00,//3
	0X0D,0X00,0X00,//4
	0X0A,0X00,0X0A,//5
	0X00,0X00,0X3F,//6
	0X00,0X0F,0X0F,//7
	0X00,0X0F,0X02,//8
	
	0X00,0X0F,0X00,//1	三行
	0X03,0X0F,0X00,//2
	0X0C,0X0C,0X00,//3
	0X0D,0X00,0X00,//4
	0X0A,0X00,0X0A,//5
	0X00,0X00,0X3F,//6
	0X00,0X0F,0X0F,//7
	0X00,0X0F,0X02,//8
	
	0X00,0X0F,0X00,//1	四行
	0X03,0X0F,0X00,//2
	0X0C,0X0C,0X00,//3
	0X0D,0X00,0X00,//4
	0X0A,0X00,0X0A,//5
	0X00,0X00,0X3F,//6
	0X00,0X0F,0X0F,//7
	0X00,0X0F,0X02,//8
	
	0X00,0X0F,0X00,//1	五行
	0X03,0X0F,0X00,//2
	0X0C,0X0C,0X00,//3
	0X0D,0X00,0X00,//4
	0X0A,0X00,0X0A,//5
	0X00,0X00,0X3F,//6
	0X00,0X0F,0X0F,//7
	0X00,0X0F,0X02, //8
};

//右转箭头，打开车灯
uint8_t Right_data[120] = {
	0X0F,0X1F,0X00,//1	一行
	0X00,0X00,0X00,//2
	0X00,0X00,0X00,//3
	0X00,0X00,0X00,//4
	0X00,0X05,0X00,//5
	0X00,0X00,0X00,//6
	0X00,0X00,0X00,//7
	0X0F,0X1F,0X00,//8
	               
	0X0F,0X1F,0X00,//1	二行
	0X00,0X00,0X00,//2
	0X00,0X00,0X00,//3
	0X00,0X00,0X00,//4
	0X00,0X06,0X00,//5
	0X00,0X06,0X00,//6
	0X00,0X00,0X00,//7
	0X0F,0X1F,0X00,//8
	               
	0X0F,0X1F,0X00,//1	三行
	0X00,0X05,0X00,//2
	0X00,0X05,0X00,//3
	0X00,0X05,0X00,//4
	0X00,0X05,0X00,//5
	0X00,0X05,0X00,//6
	0X00,0X05,0X00,//7
	0X0F,0X1F,0X00,//8
	               
	0X0F,0X1F,0X00,//1	四行
	0X00,0X00,0X00,//2
	0X00,0X00,0X00,//3
	0X00,0X00,0X00,//4 
	0X00,0X05,0X00,//5
	0X00,0X05,0X00,//6
	0X00,0X00,0X00,//7
	0X0F,0X1F,0X00,//8
	               
	0X0F,0X1F,0X00,//1	五行
	0X00,0X00,0X00,//2
	0X00,0X00,0X00,//3
	0X00,0X00,0X00,//4
	0X00,0X05,0X00,//5
	0X00,0X00,0X00,//6
	0X00,0X00,0X00,//7
	0X0F,0X1F,0X00 //8
};

//右转箭头，关闭车灯
uint8_t Right_data1[120] = {
	0X00,0X00,0X00,//1	一行
	0X00,0X00,0X00,//2
	0X00,0X00,0X00,//3
	0X00,0X00,0X00,//4
	0X00,0X05,0X00,//5
	0X00,0X00,0X00,//6
	0X00,0X00,0X00,//7
	0X00,0X00,0X00,//8
	               
	0X00,0X00,0X00,//1	二行
	0X00,0X00,0X00,//2
	0X00,0X00,0X00,//3
	0X00,0X00,0X00,//4
	0X00,0X06,0X00,//5
	0X00,0X06,0X00,//6
	0X00,0X00,0X00,//7
	0X00,0X00,0X00,//8
	               
	0X00,0X00,0X00,//1	三行
	0X00,0X05,0X00,//2
	0X00,0X05,0X00,//3
	0X00,0X05,0X00,//4
	0X00,0X05,0X00,//5
	0X00,0X05,0X00,//6
	0X00,0X05,0X00,//7
	0X00,0X00,0X00,//8
	               
	0X00,0X00,0X00,//1	四行
	0X00,0X00,0X00,//2
	0X00,0X00,0X00,//3
	0X00,0X00,0X00,//4 
	0X00,0X05,0X00,//5
	0X00,0X05,0X00,//6
	0X00,0X00,0X00,//7
	0X00,0X00,0X00,//8
	               
	0X00,0X00,0X00,//1	五行
	0X00,0X00,0X00,//2
	0X00,0X00,0X00,//3
	0X00,0X00,0X00,//4
	0X00,0X05,0X00,//5
	0X00,0X00,0X00,//6
	0X00,0X00,0X00,//7
	0X00,0X00,0X00 //8
};

//关闭箭头，但保留车灯
uint8_t OFF_arrow_data[120] = {
	0X0F,0X1F,0X00,//1	一行
	0X00,0X00,0X00,//2
	0X00,0X00,0X00,//3
	0X00,0X00,0X00,//4
	0X00,0X00,0X00,//5
	0X00,0X00,0X00,//6
	0X00,0X00,0X00,//7
	0X0F,0X1F,0X00,//8
	               
	0X0F,0X1F,0X00,//1	二行
	0X00,0X00,0X00,//2
	0X00,0X00,0X00,//3
	0X00,0X00,0X00,//4
	0X00,0X00,0X00,//5
	0X00,0X00,0X00,//6
	0X00,0X00,0X00,//7
	0X0F,0X1F,0X00,//8
	               
	0X0F,0X1F,0X00,//1	三行
	0X00,0X00,0X00,//2
	0X00,0X00,0X00,//3
	0X00,0X00,0X00,//4
	0X00,0X00,0X00,//5
	0X00,0X00,0X00,//6
	0X00,0X00,0X00,//7
	0X0F,0X1F,0X00,//8
	               
	0X0F,0X1F,0X00,//1	四行
	0X00,0X00,0X00,//2
	0X00,0X00,0X00,//3
	0X00,0X00,0X00,//4 
	0X00,0X00,0X00,//5
	0X00,0X00,0X00,//6
	0X00,0X00,0X00,//7
	0X0F,0X1F,0X00,//8
	               
	0X0F,0X1F,0X00,//1	五行
	0X00,0X00,0X00,//2
	0X00,0X00,0X00,//3
	0X00,0X00,0X00,//4
	0X00,0X00,0X00,//5
	0X00,0X00,0X00,//6
	0X00,0X00,0X00,//7
	0X0F,0X1F,0X00 //8
};

//左转箭头，打开车灯
uint8_t Left_data[120] = {
	0X0F,0X1F,0X00,//1	一行
	0X00,0X00,0X00,//2
	0X00,0X00,0X00,//3
	0X00,0X05,0X00,//4
	0X00,0X00,0X00,//5
	0X00,0X00,0X00,//6
	0X00,0X00,0X00,//7
	0X0F,0X1F,0X00,//8
	               
	0X0F,0X1F,0X00,//1	二行
	0X00,0X00,0X00,//2
	0X00,0X05,0X00,//3
	0X00,0X05,0X00,//4
	0X00,0X00,0X00,//5
	0X00,0X00,0X00,//6
	0X00,0X00,0X00,//7
	0X0F,0X1F,0X00,//8
	               
	0X0F,0X1F,0X00,//1	三行
	0X00,0X05,0X00,//2
	0X00,0X05,0X00,//3
	0X00,0X05,0X00,//4
	0X00,0X05,0X00,//5
	0X00,0X05,0X00,//6
	0X00,0X05,0X00,//7
	0X0F,0X1F,0X00,//8
	               
	0X0F,0X1F,0X00,//1	四行
	0X00,0X00,0X00,//2
	0X00,0X05,0X00,//3
	0X00,0X05,0X00,//4
	0X00,0X00,0X00,//5
	0X00,0X00,0X00,//6
	0X00,0X00,0X00,//7
	0X0F,0X1F,0X00,//8
	               
	0X0F,0X1F,0X00,//1	五行
	0X00,0X00,0X00,//2
	0X00,0X00,0X00,//3
	0X00,0X05,0X00,//4
	0X00,0X00,0X00,//5
	0X00,0X00,0X00,//6
	0X00,0X00,0X00,//7
	0X0F,0X1F,0X00 //8
};

//左转箭头，关闭车灯
uint8_t Left_data1[120] = {
	0X00,0X00,0X00,//1	一行
	0X00,0X00,0X00,//2
	0X00,0X00,0X00,//3
	0X00,0X05,0X00,//4
	0X00,0X00,0X00,//5
	0X00,0X00,0X00,//6
	0X00,0X00,0X00,//7
	0X00,0X00,0X00,//8
	               
	0X00,0X00,0X00,//1	二行
	0X00,0X00,0X00,//2
	0X00,0X05,0X00,//3
	0X00,0X05,0X00,//4
	0X00,0X00,0X00,//5
	0X00,0X00,0X00,//6
	0X00,0X00,0X00,//7
	0X00,0X00,0X00,//8
	               
	0X00,0X00,0X00,//1	三行
	0X00,0X05,0X00,//2
	0X00,0X05,0X00,//3
	0X00,0X05,0X00,//4
	0X00,0X05,0X00,//5
	0X00,0X05,0X00,//6
	0X00,0X05,0X00,//7
	0X00,0X00,0X00,//8
	               
	0X00,0X00,0X00,//1	四行
	0X00,0X00,0X00,//2
	0X00,0X05,0X00,//3
	0X00,0X05,0X00,//4
	0X00,0X00,0X00,//5
	0X00,0X00,0X00,//6
	0X00,0X00,0X00,//7
	0X00,0X00,0X00,//8
	               
	0X00,0X00,0X00,//1	五行
	0X00,0X00,0X00,//2
	0X00,0X00,0X00,//3
	0X00,0X05,0X00,//4
	0X00,0X00,0X00,//5
	0X00,0X00,0X00,//6
	0X00,0X00,0X00,//7
	0X00,0X00,0X00//8
};

//关闭所有灯光
uint8_t OFF_data[120] = {
	0X00,0X00,0X00,//1
	0X00,0X00,0X00,//2
	0X00,0X00,0X00,//3
	0X00,0X00,0X00,//4
	0X00,0X00,0X00,//5
	0X00,0X00,0X00,//6
	0X00,0X00,0X00,//7
	0X00,0X00,0X00,//8
	0X00,0X00,0X00,//9
	0X00,0X00,0X00,//10
	0X00,0X00,0X00,//11
	0X00,0X00,0X00,//12
	0X00,0X00,0X00,//13
	0X00,0X00,0X00,//14
	0X00,0X00,0X00,//15
	0X00,0X00,0X00,//16
	0X00,0X00,0X00,//17
	0X00,0X00,0X00,//18
	0X00,0X00,0X00,//19
	0X00,0X00,0X00,//20
	0X00,0X00,0X00,//21
	0X00,0X00,0X00,//22
	0X00,0X00,0X00,//23
	0X00,0X00,0X00,//24
	0X00,0X00,0X00,//25
	0X00,0X00,0X00,//26
	0X00,0X00,0X00,//27
	0X00,0X00,0X00,//28
	0X00,0X00,0X00,//29
	0X00,0X00,0X00,//30
	0X00,0X00,0X00,//31
	0X00,0X00,0X00,//32
	0X00,0X00,0X00,//33
	0X00,0X00,0X00,//34
	0X00,0X00,0X00,//35
	0X00,0X00,0X00,//36
	0X00,0X00,0X00,//37
	0X00,0X00,0X00,//38
	0X00,0X00,0X00,//39
	0X00,0X00,0X00 //40
};

//避障模式，青色灯光
uint8_t cyan_data[120] = {
	0X0A,0X00,0X0A,//1	一行
	0X0A,0X00,0X0A,//2
	0X0A,0X00,0X0A,//3
	0X0A,0X00,0X0A,//4
	0X0A,0X00,0X0A,//5
	0X0A,0X00,0X0A,//6
	0X0A,0X00,0X0A,//7
	0X0A,0X00,0X0A,//8
	
	0X0A,0X00,0X0A,//1	二行
	0X0A,0X00,0X0A,//2
	0X0A,0X00,0X0A,//3
	0X0A,0X00,0X0A,//4
	0X0A,0X00,0X0A,//5
	0X0A,0X00,0X0A,//6
	0X0A,0X00,0X0A,//7
	0X0A,0X00,0X0A,//8
	
	0X0A,0X00,0X0A,//1	三行
	0X0A,0X00,0X0A,//2
	0X0A,0X00,0X0A,//3
	0X0A,0X00,0X0A,//4
	0X0A,0X00,0X0A,//5
	0X0A,0X00,0X0A,//6
	0X0A,0X00,0X0A,//7
	0X0A,0X00,0X0A,//8
	
	0X0A,0X00,0X0A,//1	四行
	0X0A,0X00,0X0A,//2
	0X0A,0X00,0X0A,//3
	0X0A,0X00,0X0A,//4
	0X0A,0X00,0X0A,//5
	0X0A,0X00,0X0A,//6
	0X0A,0X00,0X0A,//7
	0X0A,0X00,0X0A,//8
	
	0X0A,0X00,0X0A,//1	五行
	0X0A,0X00,0X0A,//2
	0X0A,0X00,0X0A,//3
	0X0A,0X00,0X0A,//4
	0X0A,0X00,0X0A,//5
	0X0A,0X00,0X0A,//6
	0X0A,0X00,0X0A,//7
	0X0A,0X00,0X0A //8
};

//寻迹模式，橙色灯光
uint8_t orange_data[120] = {
	0X03,0X0F,0X00,//1	一行
	0X03,0X0F,0X00,//2
	0X03,0X0F,0X00,//3
	0X03,0X0F,0X00,//4
	0X03,0X0F,0X00,//5
	0X03,0X0F,0X00,//6
	0X03,0X0F,0X00,//7
	0X03,0X0F,0X00,//8
	
	0X03,0X0F,0X00,//1	二行
	0X03,0X0F,0X00,//2
	0X03,0X0F,0X00,//3
	0X03,0X0F,0X00,//4
	0X03,0X0F,0X00,//5
	0X03,0X0F,0X00,//6
	0X03,0X0F,0X00,//7
	0X03,0X0F,0X00,//8
	
	0X03,0X0F,0X00,//1	三行
	0X03,0X0F,0X00,//2
	0X03,0X0F,0X00,//3
	0X03,0X0F,0X00,//4
	0X03,0X0F,0X00,//5
	0X03,0X0F,0X00,//6
	0X03,0X0F,0X00,//7
	0X03,0X0F,0X00,//8
	
	0X03,0X0F,0X00,//1	四行
	0X03,0X0F,0X00,//2
	0X03,0X0F,0X00,//3
	0X03,0X0F,0X00,//4
	0X03,0X0F,0X00,//5
	0X03,0X0F,0X00,//6
	0X03,0X0F,0X00,//7
	0X03,0X0F,0X00,//8
	
	0X03,0X0F,0X00,//1	五行
	0X03,0X0F,0X00,//2
	0X03,0X0F,0X00,//3
	0X03,0X0F,0X00,//4
	0X03,0X0F,0X00,//5
	0X03,0X0F,0X00,//6
	0X03,0X0F,0X00,//7
	0X03,0X0F,0X00 //8
};

//跟随模式，粉色灯光
uint8_t Follow_data[120] = {
	0X00,0X0F,0X02,//1	一行
	0X00,0X0F,0X02,//2
	0X00,0X0F,0X02,//3
	0X00,0X0F,0X02,//4
	0X00,0X0F,0X02,//5
	0X00,0X0F,0X02,//6
	0X00,0X0F,0X02,//7
	0X00,0X0F,0X02,//8
	
	0X00,0X0F,0X02,//1	二行
	0X00,0X0F,0X02,//2
	0X00,0X0F,0X02,//3
	0X00,0X0F,0X02,//4
	0X00,0X0F,0X02,//5
	0X00,0X0F,0X02,//6
	0X00,0X0F,0X02,//7
	0X00,0X0F,0X02,//8
	
	0X00,0X0F,0X02,//1	三行
	0X00,0X0F,0X02,//2
	0X00,0X0F,0X02,//3
	0X00,0X0F,0X02,//4
	0X00,0X0F,0X02,//5
	0X00,0X0F,0X02,//6
	0X00,0X0F,0X02,//7
	0X00,0X0F,0X02,//8
	
	0X00,0X0F,0X02,//1	四行
	0X00,0X0F,0X02,//2
	0X00,0X0F,0X02,//3
	0X00,0X0F,0X02,//4
	0X00,0X0F,0X02,//5
	0X00,0X0F,0X02,//6
	0X00,0X0F,0X02,//7
	0X00,0X0F,0X02,//8
	
	0X00,0X0F,0X02,//1	五行
	0X00,0X0F,0X02,//2
	0X00,0X0F,0X02,//3
	0X00,0X0F,0X02,//4
	0X00,0X0F,0X02,//5
	0X00,0X0F,0X02,//6
	0X00,0X0F,0X02,//7
	0X00,0X0F,0X02,//8
};


 
void delay_us(u32 nus){        //延时程序n为1时大概延时时间为370ns左右
	while(nus--);
}
 
void send_code(uint8_t * sdata){    //发送亮度数据
	uint8_t i = 0,n = 0;
	uint8_t x = 0,y = 0,z = 0;
	
	for(x = 0;x < 120;x++){        //发送18字节数据；18 = 一个灯3字节数据*6个灯
		n = sdata[x];
		for(y = 0;y < 8;y++){
			z = ((n<<y)&0x80);
			if(z){
				RGB_PIN = 1;        //灯的控制脚位设置为输出高
				delay_us(7);        
				RGB_PIN = 0;
				delay_us(1);    //灯的控制脚位设置为输出低
			}else{
				RGB_PIN = 1;
				delay_us(1);
				RGB_PIN = 0;
				delay_us(7);
			}
		}
	}
}

//关闭所有灯光
void OFF_RGB(void)
{
	RGB_PIN = 0;
	Delay_us(310);	    //发送数据前发送300us以上的复位数据
	send_code(&OFF_data[0]);
	Delay_us(310);	    
	send_code(&OFF_data[0]);        //控制灯的数据发送两次以防其他影响
	RGB_PIN = 0;
	Delay_ms(310);        
	RGB_PIN = 1; 
}
 
//左转开车灯 
void Left_arrow(void)
{
	RGB_PIN = 0;
	Delay_us(310);	    //发送数据前发送300us以上的复位数据
	send_code(&Left_data[0]);
	Delay_us(310);	    
	send_code(&Left_data[0]);        //控制灯的数据发送两次以防其他影响
	RGB_PIN = 0;
	Delay_ms(310);        
	RGB_PIN = 1; 
}

//左转关车灯
void Left_arrow_OFF_LIGHT(void)
{
	RGB_PIN = 0;
	Delay_us(310);	    //发送数据前发送300us以上的复位数据
	send_code(&Left_data1[0]);
	Delay_us(310);	    
	send_code(&Left_data1[0]);        //控制灯的数据发送两次以防其他影响
	RGB_PIN = 0;
	Delay_ms(310);        
	RGB_PIN = 1; 
}
 
//右转开车灯
void Right_arrow(void)
{
	RGB_PIN = 0;
	Delay_us(310);	    //发送数据前发送300us以上的复位数据
	send_code(&Right_data[0]);
	Delay_us(310);	    
	send_code(&Right_data[0]);        //控制灯的数据发送两次以防其他影响
	RGB_PIN = 0;
	Delay_ms(310);        
	RGB_PIN = 1; 
}

//右转关车灯
void Right_arrow_OFF_LIGHT(void)
{
	RGB_PIN = 0;
	Delay_us(310);	    //发送数据前发送300us以上的复位数据
	send_code(&Right_data1[0]);
	Delay_us(310);	    
	send_code(&Right_data1[0]);        //控制灯的数据发送两次以防其他影响
	RGB_PIN = 0;
	Delay_ms(310);        
	RGB_PIN = 1; 
}

//关闭转向灯，开车灯
void on_the_headlights(void)	//关闭方向灯，保留照明灯
{
	RGB_PIN = 0;
	Delay_us(310);	    //发送数据前发送300us以上的复位数据
	send_code(&OFF_arrow_data[0]);
	Delay_us(310);	    
	send_code(&OFF_arrow_data[0]);        //控制灯的数据发送两次以防其他影响
	RGB_PIN = 0;
	Delay_ms(310);        
	RGB_PIN = 1; 
}

//彩虹灯
void Rainbow_mbp(void)
{
	RGB_PIN = 0;
	Delay_us(310);	    //发送数据前发送300us以上的复位数据
	send_code(&Rainbow_data[0]);
	Delay_us(310);	    
	send_code(&Rainbow_data[0]);        //控制灯的数据发送两次以防其他影响
	RGB_PIN = 0;
	Delay_ms(310);        
	RGB_PIN = 1; 
}

//避障模式灯光
void OB_mbp(void)
{
	RGB_PIN = 0;
	Delay_us(310);	    //发送数据前发送300us以上的复位数据
	send_code(&cyan_data[0]);
	Delay_us(310);	    
	send_code(&cyan_data[0]);        //控制灯的数据发送两次以防其他影响
	RGB_PIN = 0;
	Delay_ms(310);        
	RGB_PIN = 1; 
}

//寻迹模式灯光
void tracking_mbp(void)
{
	RGB_PIN = 0;
	Delay_us(310);	    //发送数据前发送300us以上的复位数据
	send_code(&orange_data[0]);
	Delay_us(310);	    
	send_code(&orange_data[0]);        //控制灯的数据发送两次以防其他影响
	RGB_PIN = 0;
	Delay_ms(310);        
	RGB_PIN = 1; 
}

//跟随模式灯光
void Follow_mbp(void)
{
	RGB_PIN = 0;
	Delay_us(310);	    //发送数据前发送300us以上的复位数据
	send_code(&Follow_data[0]);
	Delay_us(310);	    
	send_code(&Follow_data[0]);        //控制灯的数据发送两次以防其他影响
	RGB_PIN = 0;
	Delay_ms(310);        
	RGB_PIN = 1; 
}
 
